# Используем официальный образ Node.js версии 18 в качестве базового
FROM node:18

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /web

# Копируем package.json и package-lock.json для установки зависимостей
COPY package*.json ./

# Устанавливаем зависимости
RUN npm install

# Копируем все файлы проекта в контейнер
COPY . .

# Собираем приложение для продакшена
RUN npm run build

# Используем сервер для статических файлов, например serve, если его используете
# RUN npm install -g serve

# Указываем команду по умолчанию для запуска контейнера
CMD ["npm", "run", "serve"]

# Открываем порт (по умолчанию serve работает на 5000 порту)
EXPOSE 8080
